In [2]:
import pandas as pd

In [3]:
"""
What is in pandas?
1. Series
2. Data Frames
3. Missing Data
4. Group By
5. Merging, Joining, Concatenating
6. Operations
7. Data Input and Output
"""

'\nWhat is in pandas?\n1. Series\n2. Data Frames\n3. Missing Data\n4. Group By\n5. Merging, Joining, Concatenating\n6. Operations\n7. Data Input and Output\n'

In [5]:
# Series: Data type in pandas

In [6]:
import numpy as np

In [7]:
# crrating various series

In [13]:
labels = ['a', 'b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a': 10, 'b': 20, 'c': 30}

In [14]:
my_data

[10, 20, 30]

In [15]:
arr

array([10, 20, 30])

In [16]:
d

{'a': 10, 'b': 20, 'c': 30}

In [18]:
# create series, with index values
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [21]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [22]:
# more ways to create series
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [23]:
# In case of dictionary it automatically get keys
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [24]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [26]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [27]:
pd.Series(data=[sum, print, len, max])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
3      <built-in function max>
dtype: object

In [28]:
# using series is understanding index

In [32]:
ser1 = pd.Series([1,2,3,4], ['USA', 'GERMANY', 'uk', 'CANADA'])

In [33]:
ser1

USA        1
GERMANY    2
uk         3
CANADA     4
dtype: int64

In [34]:
ser1[1]

2

In [35]:
ser1['USA']

1

In [37]:
ser1

USA        1
GERMANY    2
uk         3
CANADA     4
dtype: int64

In [38]:
# Data frames

In [39]:
from numpy.random import randn

In [40]:
np.random.seed(101)

In [41]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [42]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
# In above each column is series

In [44]:
# its a series
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [45]:
type(df['W'])

pandas.core.series.Series

In [46]:
type(df)

pandas.core.frame.DataFrame

In [47]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [48]:
# create a data frame of two columns
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [49]:
df['new'] = df['W'] + df['Y']

In [51]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [53]:
# original is not change
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
# to change original, use inplace  arguments

In [56]:
df.drop('new', axis=1, inplace=True)

In [57]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
# rows at  axis 0
# columns at axis 1
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [61]:
# get shape of data frame
df.shape

(5, 4)

In [62]:
df[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [63]:
# ROWS

In [64]:
# return data of row A
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [69]:
# get row using index position using iloc, pass index value

In [70]:
df.iloc[1]

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [71]:
# selecting subset of rows and columns

In [72]:
# It return single value
df.loc['A','W']

2.706849839399938

In [73]:
df.loc[['A','B'], ['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077